# Common dependencies
tap 'homebrew/bundle'
tap 'homebrew/dupes'
brew 'imagemagick'
brew 'openssl'
# link openssl --force
brew 'tcl-tk', args: ['without-tk']

# Useful dev utilities
brew 'curl'
brew 'emacs'
brew 'git'
brew 'htop'
brew 'jq'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vim'
brew 'zsh'

# Java stuff
brew 'jenv'

# Python stuff
brew 'python'

# Ruby stuff
brew 'rbenv'
brew 'rbenv-gem-rehash'
brew 'ruby-build'

## Node stuff
# brew 'node'
# brew 'phantomjs'

## does not yet work with Linux
## Cask stuff
# tap 'caskroom/cask'
# brew 'brew-cask'
# cask 'eclipse-ide'
# cask 'sublime-text'
